Boeing737max/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-5;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    frontAndBack
    {
        type calculated;
        value uniform 0;
    }

    inlet
    {
        type calculated;
        value uniform 0;
    }

    outlet
    {
        type calculated;
        value uniform 0;
    }

    lowerWall
    {
        type nutkWallFunction;
        value uniform 0;
    }

    upperWall
    {
        type calculated; // Replace with calculated to avoid conflicts with scalar fields
        value uniform 0;
    }

    Boeing737Max8
    {
        type nutkWallFunction;
        value uniform 0;
    }
}


// ************************************************************************* //
