Boeing737max/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;;  // Set to sea level standard

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type zeroGradient;
    }
    outlet
    {
        type fixedValue;
        value $internalField;
    }
    lowerWall
    {
        type zeroGradient; // Wall zero gradient
    }
    Boeing737Max8
    {
        type zeroGradient; // Wall zero gradient
    }
    frontAndBack
    {
        type zeroGradient;
    }
    upperWall
    {
        type zeroGradient;
    }

    #include "include/frontBackUpperPatches"
}


// ************************************************************************* //
